from config_botfromlec import *

start = "Рады вас приветствовать в магазине настольных игр."

about = "Мы продаем лучшие игры уже 2000 лет, но вы нам не поверите, поэтому скажем что два дня"

Mgame = f' Лучший вариант для начинающих, игра небольшого размера. Стоимость {priceM} руб.'

Lgame = f'Альтернатива для тех, кто не знает, что выбрать. Стоимость {priceL} руб.'

XLgame  = f'Лучший комплект для игромана, игра плюс бонусные материалы по ней.  Стоимость {priceXL} руб. '

other = "Вы хотите что-то другое, обратитесь к админу @MegaAdminNastolokRU."

qw = "Что вас интересует?"